Revit 2018 API
VertexStreamPositionColored Class
 A stream that can be used to write vertices of type VertexPositionColored into a buffer (see Autodesk::Revit::DB::DirectContext3D::VertexBuffer).
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2017
Syntax
C#
public class VertexStreamPositionColored : VertexStream
Visual Basic
Public Class VertexStreamPositionColored _
	Inherits VertexStream
Visual C++
public ref class VertexStreamPositionColored : public VertexStream
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DirectContext3D.VertexStream
 Autodesk.Revit.DB.DirectContext3D.VertexStreamPositionColored
See Also
VertexStreamPositionColored Members
Autodesk.Revit.DB.DirectContext3D Namespace